# ДЗ к Уроку №1 Гладышев ВВ

"""
Задание №1

Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
"""

print(f"Побитовое И: 5&6 = {5&6}")
print(f"Побитовое ИЛИ: 5|6 = {5|6}")
print(f"Побитовое исключающее ИЛИ: 5^6 = {5^6}")
print(f"Побитовое сдвиг вправо на два бита: 5>>2 = {5>>2}")
print(f"Побитовое сдвиг влево на два бита: 5<<2 = {5<<2}")
