# ДЗ к Уроку №3 Гладышев ВВ

"""
Задание №1

В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
"""

print([99//i for i in range(2, 10)])
